সংখ্যা গুলো কিভাবে আসে তা আমরা দেখি -
1
(i)a
(ii)1+b
(i)-->a^2.....(iii)
(i)-->a+b......(iv)
(ii)-->a+ab.....(v)
(ii)-->1+2b......(vi)
(iii)-->a^3.......(vii)
(iii)-->a^2+b......(viii)
(viii)-->a^3+ab

এরকম । মানে , কোনো সংখ্যা n=1 বা n%b==1 হলে সে সংখ্যা অবশ্যই সেটে থাকবে । 
এছাড়া সংখ্যাগুলো এই ফরম্যাট এর হবে --> a^x+y*b=n
এটা চেক করার জন্য আমরা a এর উপরের পাওয়ার এক এক করে বাড়াতে থাকব । তারপর n থেকে সেটা বিয়োগ করে প্রাপ্ত সংখ্যা b দ্বারা নিঃশেষে বিভাজ্য হয় কিনা চেক করব ।
যদি হয় তবে তো সেটে থাকবে সে সংখ্যা । 
ততক্ষন চেক করব যতক্ষন  a^x+y*b<=n থাকছে । 

import sys
input=sys.stdin.buffer.readline

#These two lines are just to run code faster

for _ in range(int(input())):
    n,a,b=map(int,input().split())
    if n==1 or n%b==1:
        print("Yes")
    else:
        y=a
        while(y<=n):
            if (n-y)%b==0:
                print("Yes")
                break
            elif a==1:             
                print("No")
                break
                #উপরের কন্ডিশন চেক করে সত্য হয় নাই এবং এখন যদি a এর মান 1 থাকে তবে আর চেক করার কিছু নাই । উপরে যে দেখানো হইছে সংখ্যাগুলো কিভাবে আসছে ,ওখানে a=1
                #বসিয়ে চেক করলে দেখা যাবে সব সংখ্যা 1+yb formate  এ থাকবে । তার মানে n%b==1 কন্ডিশন ফেইল করলে সেই সংখ্যা সেটে থাকার প্রশ্নই আসে না ।
            y *=a
            #y=a**3 , y=a**4 .... y=a**23 এভাবে করেও আমরা y এর মান বাড়াতে পারতাম তবে সেটা করতে টাইম বেশি লাগল । সেটার পরিবর্তে আমরা আগে y=a^3 থাকলে তার সাথে আরেকটা a গুণ দিয়ে
            #y=a^4 করলাম । মানে প্রতিবার একটা করে a multiply করলাম । 
        else:
            print("No")
