(১)দুইজনই ট্রাই করবে এমন একটা ডিভিসর বিয়োগ করার যেন বিয়োগ করার পর সংখ্যাটা বিজোড় সংখ্যা হয় । কারণ তাহলে সংখ্যাটা প্রাইম হতে পারে । যদি প্রাইম নাও হয় , তাহলে পরের জন চাল দেয়ার পর প্রাপ্ত 
সংখ্যা অবশ্যই জোড় হবে । আর জোড় হলে সে চাল দিতে পারবেই । তাই যেহেতু Alice প্রথমে চাল দিবে তাই সংখ্যাটা বিজোড় হলে Alice চাল দেয়ার পর সংখ্যাটা অবশ্যই জোড় হবে । এরপর বব চাল দেয়ার পর
সে চেষ্টা করবে সংখ্যাটা আবার বিজোড় করার । আর যেহেতু একটি জোড় সংখ্যার জোড় এবং বিজোড় উভয় ডিভিসর ই থাকে, তাই একটা জোড় সংখ্যাকে বিজোড় করে দেয়া কোনো ব্যাপার ই না। তাই সংখ্যাটি বিজোড়
হবে বুঝাই যায়। 

(২) সংখ্যাটি জোড় হলে ২ রকম হতে পারে-
    (i) n=2^somethig
    সংখ্যাটি ২ এর পাওয়ার হলে , something=odd হলে খেলা চলে জোড় সংখ্যক, সেক্ষেত্রে বব জিতে যাবে । কারণ প্রত্যেকে চাইবে এমন চাল দিতে যেন পরের জনের কাছে এমন সংখ্যা যায় যেটা 2^something
    কারন এই ফরম্যাট এর সংখ্যা কে odd করা যায় না । 
    something=even হলে খেলা চলে বিজোড় সংখ্যক, সেক্ষেত্রে Alice জিতে যাবে ।
    
    (ii) জোড় তবে ২ এর পাওয়ার না হলে , Alice সেটাকে অবশ্যই বিজোড় করবে । আর Bob এর কাছে সেটাকে জোড় করা ছাড়া আর কিছু করার নেই । So , Alice জিতে যাবে। 



import math
for _ in range(int(input())):
    n=int(input())
    if n%2==1 :
        print("Bob")
    else:
        x=math.log10(n)/math.log10(2)
        if math.ceil(x)==math.floor(x):
            if x%2==0:
                print("Alice")
            else:
                print("Bob")
        else:
            print("Alice")
